Revit 2024 API
BuiltInFailures.CuttingFailures.ElementsWithNotCopiedParentsDeleted Property
 Some elements were deleted because elements that they require for references were not copied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ElementsWithNotCopiedParentsDeleted { get; }
Visual Basic
Public Shared ReadOnly Property ElementsWithNotCopiedParentsDeleted As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ElementsWithNotCopiedParentsDeleted {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CuttingFailures Class
Autodesk.Revit.DB Namespace